Repository: remipannequin/emulica
Catalog: po/*.po
Languages: fr

source: a time limit must be set if executing in discrete-events mode
fr: une limite de temps doit être fixée en mode d'avance de temps par événement discret

source: unknown module {0}
fr: module {0} inconnu

source: sending report {0}
fr: envoi du compte-rendu {0}

source: attaching reports store to module {0}
fr: association de la queue de comptes-rendus au module {0}

source: connection opened by {0}
fr: connexion ouverte par {0}

source: Another client is already connected: disconnecting...
fr: Un client est déjà connecté : déconnexion...

source: received request {0}
fr: réception de la requête {0}

source: Error in processing message: {0}
fr: Erreur de traitement du message: {0}

source: a default path will be used
fr: un chemin par défaut sera utilisé

source: simulation stopped at t={0}
fr: simulation stoppée à t={0}

source: 'main' is a reserved name
fr: 'main' est un nom réservé

source: registering control process {0}
fr: enregistrement du process de contrôle {0}

source: product ID {0} has already been used
fr: l'identifiant de produit {0} a déjà été utilisé

source: product {pid} created at {time}
fr: le produit {pid} est créé à t={time}

source: product {pid} disposed at {time}
fr: le produit {pid} est prêt à t={time}

source: parameters={0}
fr: paramètres={0}

source: location={0}
fr: emplacement={0}

source: Report {what} from {who} at t={when}
fr: Compte-Rendu de l'état {what} provenant du module {who} à t={when}

source: Processes
fr: Process

source: Performance Degradation
fr: Dégradation de performance

source: Repeat
fr: Répéter

source: Products properties
fr: Propriétés des produits

source: Program table
fr: Programmes

source: Setup matrix
fr: Matrice de réglage

source: program {0} is not in the program table
fr: le programme {0} n'est pas dans la table

source: module {name} doing setup at {t}
fr: module {name} effectue un réglage à {t}

source: Physical changes
fr: Modifications Physiques

source: Holder
fr: Conteneur

source: cannot treat more than one product at once
fr: ne peut pas traiter plus d'un produit à la fois

source: could not find physical property {0}
fr: Impossible de trouver la caractéristique physique {0}

source: starting assembleAct {0}
fr: démarrage de l'actionneur d'assemblage {0}

source: module {name} ready at {t}
fr: module {name} prêt à {t}

source: begining setup on module {0}
fr: début du réglage sur le module {0}

source: finished setup on module {0}
fr: fin du réglage sur le module {0}

source: begining assembly on module {0}
fr: début de l'assemblage sur le module {0}

source: locking holder on module {0}
fr: verrouillage du conteneur sur le module {0}

source: fetching products to assemble in module {0}
fr: obtention des produits à assembler sur le module {0}

source: assembling with an empty product
fr: assemblage sans produit

source: starting diassembleAct {0}
fr: démarrage de l'actionneur d'assemblage {0}

source: begining diassembling on module {0}
fr: début de l'assemblage sur le module {0}

source: Capacity
fr: Capacité

source: Speed
fr: Vitesse

source: no product ready in this holder
fr: aucun produit n'est prêt dans ce conteneur

source: Event Name
fr: Événement

source: Observe identity
fr: Observer l'identité

source: Observe Type
fr: Observer le type

source: t={0}: observation done!
fr: t={0}: observation réalisée !

source: unable to find emulation.xml
fr: impossible de charger emulation.xml

source: unable to find control.py
fr: impossible de charger control.py

source: unable to find props.db
fr: impossible de charger props.db

source: Invalid opening mode, only 'r' (for reading) and 'w' (for writing) are valid modes.
fr: Mode d'ouverture invalide, seul les modes 'r' (pour la lecture) et 'w' (pour l'écriture) sont valides.

source: control code compilation sucessfull
fr: compilation du code du système de contrôle réalisée avec succès

source: initialization function have not been implemented
fr: Attention : la fonction d'initialisation n'a pas été déclarée

source: time
fr: temps

source: holder occupation
fr: Occupation des conteneurs

source: product life-cycle
fr: Cycle de vie produit

source: Too many row in product chart, add_serie is ignored...
fr: Trop de ligne dans le diagramme produit, add_serie est ignorée...

source: gantt chart
fr: Diagramme de Gantt

source: Adding an empty trace to gantt chart
fr: Ajout d'une trace vide au diagramme de gantt

source: changing setup: ({initial}, {final}) -> ({new_init}, {new_final})
fr: modification du changement de série : ({initial}, {final}) -> ({new_init}, {new_final})

source: changing setup time: {0:f}) -> {1:f}
fr: Modification du délai du changement de série {0:f} -> {1:f}

source: String
fr: Chaîne de caractères

source: Boolean
fr: Booléen

source: Integer
fr: Entier

source: Float
fr: Nombre à virgule flotante

source: List of modules
fr: Liste de modules

source: Setup table
fr: Table de réglages

source: Evaluable string
fr: Chaîne évaluable

source: List of physical properties
fr: Caractéristiques physiques

source: module {0} added
fr: module {0} ajouté

source: module {0} removed
fr: module {0} supprimé

source: Import emulation model...
fr: Importer le modèle d'émulation...

source: Export control model...
fr: Exporter le modèle de contrôle...

source: export failed
fr: échec de l'exportation

source: Select request parameters
fr: Choix des paramètres de la requête

source: Receiver:
fr: Destinataire :

source: Program:
fr: Programme :

source: Product type:
fr: Type produit :

source: Product ID:
fr: Identifiant produits :

source: Control code compiled succefully.
fr: compilation du code du système de contrôle réalisée avec succès

source: Control code compilation failed.
fr: la compilation du code du système de contrôle a échoué.

source: Select control snippet to insert
fr: Choisissez l'échantillon de code

source: Main Import
fr: Import principal

source: Empty control class
fr: Classe de contrôle vide

source: Emulation module
fr: Module d'émulation

source: Put request
fr: Envoyer une requête

source: Get report
fr: Obtenir un compte-rendu

source: Wait idle state
fr: Attente de l'état inactif

source: Availlable Snippets
fr: Extrait disponibles

source: running
fr: exécution

source: starting
fr: lancement

source: finished
fr: terminé

source: Exception when runing emulation:
fr: Exception lors de l'exécution de l'émulation :

source: ready
fr: prêt

source: Save File...
fr: Enregistrement...

source: untitled
fr: sans titre

source: Do you want to save modifications in document {0} before closing?
fr: Voulez-vous sauvegarder les modifications du document « {0} » avant de le fermer ?

source: Close without saving
fr: Fermer sans enregistrer

source: If you don't save all modifications will be lost.
fr: Si vous n'enregistrez pas, toutes les modifications seront perdues.

source: Open File...
fr: Ouverture...

source: Loading {0}
fr: Chargement de {0}

source: model did not have any layout.
fr: le modèle ne contient pas d'élément de disposition.

source: Could not open file: {filename}s {warning}
fr: Ouverture impossible du fichier {filename} {warning}

source: Saving {0}
fr: Enregistrement de {0}

source: Could not save file: {0}
fr: Échec de l'enregistrement : {0}

source: File: {0}
fr: Fichier {0}

source: File: (UNTITLED)
fr: Fichier : (Sans titre)

source: Export emulation model...
fr: Exporter le modèle d'émulation...

source: property{0}
fr: propriété{0}

source: Properties of {0}
fr: Propriétés de {0}

source: Module Name
fr: Nom du module

source: Add Property...
fr: Ajouter une propriété...

source: Add a new property to {0}
fr: Ajouter une nouvelle propriété à {0}

source: Name:
fr: Nom :

source: <i>No properties to display</i>
fr: <i>Aucune propriété à afficher</i>

source: Edit...
fr: Éditer

source: {0:d} programs
fr: {0:d} programmes

source: Edit program table
fr: Éditer la table des programmes

source: program{0}
fr: programme{0}

source: changing program {name} to {new_name}
fr: changement du nom du programme {name} en {new_name}

source: Edit Setup Matrix
fr: Éditer la matrice de réglage

source: Default setup time:
fr: Temps de changement par défaut :

source: Product Chart
fr: Diagramme produits

source: Gantt Chart
fr: Diagramme de Gantt

source: Holder occupation
fr: Occupation des conteneurs

source: Summary
fr: Résumé

source: Export results...
fr: Exporter les résultats...

source: Include all
fr: Inclure tout

source: Type of chart
fr: Type de Diagramme

source: Save Results as:
fr: Sauvegarder les résultats

source: Include raw result (csv)
fr: Inclure les résultats bruts (csv)

source: Include summary (txt)
fr: Inclure le résumé

source: File prefix:
fr: Préfixe des fichiers :

source: Saving Directory
fr: Répertoire de sauvegarde
